---
kind: other
id: Properties.T:Autodesk.Revit.DB.HostedSweepType
source: html/af32c139-1757-c656-c212-5a1fb99fb746.htm
---
# HostedSweepType Properties

The id of the assembly instance to which the element belongs.